art/note/sicp_all_in_one.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-24 Sat 16:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP: a book for new bie</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">SICP: a book for new bie</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgae93eb1">1. Python Version</a>
<ul>
<li><a href="#orgbb13be8">1.1. Building Abstraction with Functions</a></li>
</ul>
</li>
<li><a href="#orga9a4d91">2. Original Version (Scheme Version)</a></li>
</ul>
</div>
</div>
<p>
you need to note that the note here is only for a temporary note for myself, the individual, but not for the readers (note the plural here).
</p>

<div id="outline-container-orgae93eb1" class="outline-2">
<h2 id="orgae93eb1"><span class="section-number-2">1</span> Python Version</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2023-06-22 Thu 22:47] </span></span> <br />
I shall not divide the chapter. I think that is very useless.</li>
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2023-06-22 Thu 22:46] </span></span> <br />
Python Version is from <a href="https:composingprograms.com">Composing Programs</a>. And the basic structure is very similar but there is no exercise but four labs.</li>
</ul>
</div>

<div id="outline-container-orgbb13be8" class="outline-3">
<h3 id="orgbb13be8"><span class="section-number-3">1.1</span> Building Abstraction with Functions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The chapter is about functions.
</p>

<p>
Quote: A language isn't something you learn s omuch as something you join.
</p>

<p>
One may not get it. It says that mastering the grammar of a language does not make you the master of the language.
</p>

<p>
Note on 1.1.3 interactive controls: it won't work on emacs shell
</p>

<p>
The example on Shakespeare is not that good. You should note that.
</p>

<p>
<b>Evaluation and Executation</b>: the two concepts are what you should notice.
And the two purposes are what we should notice too, that are 1. compute some value and carry out some action. 
</p>

<p>
The section tells about the <b>Object</b>. You can just pass it.
</p>

<p>
The discussion about debugging is very useful (at the first sight). Ok, I admit, it is useless.
</p>

<p>
End of section one. Section one is easy.
</p>

<p>
Python use <i>infix</i> notation. that is to say the operator is placed between the operands. for example (1 - 1). There is also prefix notation. Scheme use prefix notation. For example (- 1 1).
</p>

<pre class="example">
max (7.5 , 9.5)
</pre>

<p>
The operator specifies a function. When this call expression is evaluated, we say that the function max is <i>called</i> with <i>arguments</i> 7.5 and 9.5, and <i>returns</i> a value of 9.5.
</p>

<p>
the concepts of <b>call, argument, and return value</b> are very important.
</p>

<p>
importing library is not necessary right now. But it is the feature of python. you should know it. But you should try learning it.
</p>

<p>
Because you should import some operators that will be used for future. Anyway, this is the exact way to make python be of more features of scheme.
</p>

<p>
In scheme you write + as
</p>
<pre class="example">
(+ 1 2)
</pre>
<p>
the value should be 3. The nested expression could be very intoleratable for scheme.
</p>

<p>
Names are called identifier (maybe). "Name" should be enough. The value is actually <i>binded</i> to name. That is, you write name, the interpreter find the value based on the name.
</p>

<p>
The environment is something important too.
</p>

<pre class="example">
x , y = 3, 4.5
</pre>

<p>
the expression above is something not interesting, but many languages do not have the feature (of course, there are some other languages do have the feature).
</p>

<p>
To evaluate a call expression, Python will do the following:
</p>

<ol class="org-ol">
<li>Evaluate the operator and operand subexpressions, then</li>
<li>Apply the function that is the value of the operator subexpression to the arguments that are the values of the operand subexpressions.</li>
</ol>

<p>
The word "recursive" appeared for the first time. And evaluating an expression needs to know something like the information about the language and parse tree and the context-free grammar. OK, I have forgotten about the terminologies there (I mean the context-free grammar or something). 
</p>

<p>
The expression tree can be called parse tree, too.
</p>

<p>
Execution and evaluation: For example
</p>
<pre class="example">
&gt;&gt;&gt; x = 3
</pre>
<p>
the statement is not evaluated but executed. Although in scheme, the interpreter will still return a value (that is <code>x</code> itself).
</p>


<p>
If you use scheme, the difference between pure function and non-pure function will be more clear. The interpreter of scheme must print the return value of the S-expression, so it will definitely print the return value of the display function (that is the <code>print</code> function in scheme).
</p>

<p>
when you read the section 1.3, you should import the function (the operators) like <code>mul</code> and <code>add</code> in the previous chapter.
</p>

<p>
When you are in the shell using python3, you should be careful about the indent.
</p>


<p>
What the fuck is intrinsic name and bound name.
There is difference between the two: different names may refer the smae functio, but that function itself has only one intrinsic name. 
</p>

<p>
For example, when you define a function, like an add<sub>one</sub> function:
</p>
<pre class="example">
def add_one (x):
    return x+1
</pre>
<p>
and you just get a function. Intrinsic name is the name to name the function. The bound name is the name that is bounded to the functions.
</p>

<p>
For  example, I enter the next prompt
</p>
<pre class="example">
another_add_one = add_one
</pre>
<p>
that is to say <code>another_add_one</code> is the bound name. I shall print some results here:
</p>
<pre class="example">
&gt;&gt;&gt; def add_one (x):
...  return x + 1
... 
&gt;&gt;&gt; another_add_one = add_one
&gt;&gt;&gt; another_add_one
&lt;function add_one at 0x7fcc49ff6820&gt;
&gt;&gt;&gt; add_one
&lt;function add_one at 0x7fcc49ff6820&gt;
&gt;&gt;&gt; 
</pre>

<p>
You can see that the <code>add_one</code> is the intrinsic name. When I call the interpreter to print the information of <code>my_add_one</code>, it prints 
</p>
<pre class="example">
&lt;function add_one at 0x7fcc49ff6820&gt;
</pre>
<p>
as well. Very cool.
</p>

<p>
Evaluation:
To evaluate a call expression whose operator names a user-defined
function, the Python interpreter follows a computational process.
As with any call expression, the interpreter evaluates the operator
and operand expressions, and then applies the named function to
the resulting arguments.
</p>



<p>
And you should know what is frame now.  It is an important concept as well
</p>

<p>
Local name. It is cool that you don't understand the concept when you are programming. But when you are about to write an interpreter, the concept is inevitable.
</p>

<p>
The book should just note the definition of the local name with the mark  <code>Def</code>, just like that in the mathematics textbook.
</p>

<p>
Here is where the concept of the scope is used:  
</p>

<p>
Critically, this is not the case: the binding for x in different
local frames are unrelated. The model of computation is carefully designed to
ensure this independence.
</p>

<p>
We say that the <i>scope</i> of a local name is limited to the body of the user-defined
function that defines it. When a name is no longer accessible, it is out of scope.
This scoping behavior isn't a new fact about our model; it is a consequence of
the way environments work.
</p>


<p>
The elements of a function here: the domain, the range and the intent.
What the fuck is indent? Never heard of it before.
</p>

<p>
The section of the operators is simple. But about the operators, you should know that there is something you should notice: that is the relation between an operator and an function for example like: <code>+</code> and <code>add</code>. 
And it  is also important that the approach that evaluation uses is very important.
</p>

<p>
And you should now be familiar with the terminology of evaluation.
</p>
</div>
</div>
</div>






<div id="outline-container-orga9a4d91" class="outline-2">
<h2 id="orga9a4d91"><span class="section-number-2">2</span> Original Version (Scheme Version)</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-06-24 Sat 16:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>